app/controllers/products_controller.rb

  def create
    Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2019-06-10 07:03:33.300967"], ["updated_at", "2019-06-10 07:03:33.300967"], ["inventory", 12], ["description", "This is a great thing"]]

  def show
    @products = Product.all
    @product = Product.find_by_id(params[:id])
---
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]